In [4]:
# Python is case sensetive 
# ###

In [5]:
a = 10
a

10

In [6]:
A

NameError: name 'A' is not defined

In [7]:
b = 12 
c = 14 
d= 34


b
c
d

34

In [1]:
b
d
c

NameError: name 'b' is not defined

In [9]:
print(b)
print(c)
print(d)

12
14
34

In [10]:
name = "Mr.a"
age  = 20

In [14]:
print("name is "     ,   name  ,    "     age is " , age)

name is  Mr.a      age is  20

In [15]:
#  delete a vataible

In [16]:
name

'Mr.a'

In [17]:
del(name) # delete the varibable

In [18]:
name

NameError: name 'name' is not defined

In [19]:
name = "Mr.a"
age  = 20 
print("name is", name, "age is", age)

name is Mr.a age is 20

In [21]:
age  == 21  # checking

False

In [22]:
age  > 21

False

In [23]:
age  < 21

True

In [24]:
age != 20 # not eqaul to 20

False

In [25]:
age != 30

True

In [26]:
# varible (data types in python)
#  1 Tuple
# 2 List
# 3 Dictionary
# 4  Set

In [27]:
# Tuple ( is one dimensional representaion data which can be of mixed type and it is      IMMUTABLE )

In [28]:
first_tuple =   ( 10 , 20 , 30 , 2, 3,4,5 , "pune")

In [29]:
first_tuple

(10, 20, 30, 2, 3, 4, 5, 'pune')

In [30]:
type(first_tuple)  # similar ot class function in R

tuple

In [31]:
first_tuple[0]  # indexig start from zero

10

In [33]:
first_tuple[-1]

'pune'

In [34]:
len(first_tuple)# to get the count , similar to length function in R

8

In [36]:
first_tuple

(10, 20, 30, 2, 3, 4, 5, 'pune')

In [38]:
first_tuple[2]   = 5555  # trying to replace 30 with 5555

TypeError: 'tuple' object does not support item assignment

In [39]:
t2    = ( 5 ,5,7,10 , 20 , 20 , 20 , 30 , 45, 30)

In [44]:
t2.count(5)  # tell how many time a element is occurring

2

In [45]:
t2.index(7)  ###  ????

2

In [46]:
t2.index(20)     # and not  index(t2 )

4

In [48]:
t2    = ( 5 ,5,7,10 , 20 , 20 , 20 , 30 , 45, 30)
len(t2)

10

In [49]:
# list  is a 1 dimensional represantion of data which can be of mixed type and they are mutable

In [51]:
first_list =   [ 10 , 20 , 30 , 2, 3,4,5 , "pune" , 10 , "mumbai" , "pune"]
first_list

[10, 20, 30, 2, 3, 4, 5, 'pune', 10, 'mumbai', 'pune']

In [52]:
type(first_list)

list

In [53]:
len(first_list)

11

In [55]:
first_list[7]

'pune'

In [56]:
first_list[7] = "nashik"  # list is mutable

In [57]:
first_list

[10, 20, 30, 2, 3, 4, 5, 'nashik', 10, 'mumbai', 'pune']

In [58]:
first_list

[10, 20, 30, 2, 3, 4, 5, 'nashik', 10, 'mumbai', 'pune']

In [59]:
first_list.append("kolhapur")

In [60]:
first_list

[10, 20, 30, 2, 3, 4, 5, 'nashik', 10, 'mumbai', 'pune', 'kolhapur']

In [62]:
first_list.clear()# shift tab

AttributeError: 'list' object has no attribute 'mean'

In [63]:
first_list

[10, 20, 30, 2, 3, 4, 5, 'nashik', 10, 'mumbai', 'pune', 'kolhapur']

In [64]:
first_list.clear()

In [65]:
first_list # empty list

[]

In [66]:
l1  = [ 10 , 23,4,5,56,6,7, " data" , "science"]

In [67]:
type(l1)

list

In [69]:
l1.count(100)

0

In [70]:
l1.extend("abcd")

In [71]:
l1

[10, 23, 4, 5, 56, 6, 7, ' data', 'science', 'a', 'b', 'c', 'd']

In [72]:
l1  = [ 10 , 23,4,5,56,6,7, " data" , "science"]

l2 = ["class"]

In [73]:
l1.extend(l2)

In [74]:
l1

[10, 23, 4, 5, 56, 6, 7, ' data', 'science', 'class']

In [75]:
l3  = [ 10 , 23,4,5,56,6,7, " data" , "science"]

l4 = ["class"  , "python"]

l3

[10, 23, 4, 5, 56, 6, 7, ' data', 'science']

In [76]:
l3.extend(l4)
l3

[10, 23, 4, 5, 56, 6, 7, ' data', 'science', 'class', 'python']

In [77]:
l3.index(23)

1

In [78]:
l3

[10, 23, 4, 5, 56, 6, 7, ' data', 'science', 'class', 'python']

In [83]:
l3.pop()
l3

[10, 23, 4, 5, 56, 6]

In [89]:
l5  = [5,6,7,9 , 100, 120, 20 , 20 , 20 , 31, 31,45]

In [90]:
l5.pop(4)
l5

[5, 6, 7, 9, 120, 20, 20, 20, 31, 31, 45]

In [92]:
l5  = [5,6,7,9 , 100, 120, 20 , 20 , 20 , 31, 31,45]
l5

[5, 6, 7, 9, 100, 120, 20, 20, 20, 31, 31, 45]

In [93]:
l5.remove(9)
l5

[5, 6, 7, 100, 120, 20, 20, 20, 31, 31, 45]

In [94]:
l5.remove(125)

ValueError: list.remove(x): x not in list

In [95]:
l5.remove(20)
l5

[5, 6, 7, 100, 120, 20, 20, 31, 31, 45]

In [96]:
l5.reverse()
l5

[45, 31, 31, 20, 20, 120, 100, 7, 6, 5]

In [98]:
l5.sort()
l5  # sort the data in ascending order

[5, 6, 7, 20, 20, 31, 31, 45, 100, 120]

In [101]:
l5.sort(reverse=True)
l5

[120, 100, 45, 31, 31, 20, 20, 7, 6, 5]

In [102]:
l5.sort()
l5

[5, 6, 7, 20, 20, 31, 31, 45, 100, 120]

In [108]:
l6  = [5,6,7,9 , 100, 120, 20 , 20 , 20 , 31, 31,45]
l6.sort()
l6.reverse()

In [106]:
l6

[120, 100, 45, 31, 31, 20, 20, 20, 9, 7, 6, 5]

In [109]:
l6  = [5,6,7,9 , 100, 120, 20 , 20 , 20 , 31, 31,45]

In [110]:
l8 =   list(    [10 , 20 , 400 , 50, 43, "data"]          )
l8

[10, 20, 400, 50, 43, 'data']

In [111]:
type(l8)

list

In [112]:
aa  =  (10, 30)
type(aa)

tuple

In [113]:
bb = list(aa)## tuple converted to list
bb

[10, 30]

In [114]:
type(bb)

list

In [115]:
# dictionary    is used to store data in key value format  and it is also used to create a Data frame

In [116]:
dict1  = {"Name" : "MrA"  ,      
          "Salary" : 100 ,    
          "Age" :20}
dict1

{'Age': 20, 'Name': 'MrA', 'Salary': 100}

In [117]:
type(dict1)

dict

In [118]:
dict1.keys()

dict_keys(['Salary', 'Age', 'Name'])

In [119]:
dict1.values()

dict_values([100, 20, 'MrA'])

In [165]:
emply_detail= {"Name" : ("A" , "B" , "C" , "D" , "E" , "F"),
               "Age"  : ( 20 , 30 ,31,35, 27 ,29)  ,
                "Salary"  :(100 , 200,120,300,450,600)}

In [166]:
emply_detail

{'Age': (20, 30, 31, 35, 27, 29),
 'Name': ('A', 'B', 'C', 'D', 'E', 'F'),
 'Salary': (100, 200, 120, 300, 450, 600)}

In [167]:
emply_detail.keys()

dict_keys(['Salary', 'Age', 'Name'])

In [168]:
emply_detail.values()

dict_values([(100, 200, 120, 300, 450, 600), (20, 30, 31, 35, 27, 29), ('A', 'B', 'C', 'D', 'E', 'F')])

In [169]:
import pandas as  pd

In [170]:
df1  =  pd.DataFrame(emply_detail)
df1

   Age Name  Salary
0   20    A     100
1   30    B     200
2   31    C     120
3   35    D     300
4   27    E     450
5   29    F     600

In [171]:
we  =  [  2,5,6,7,9,10]

In [174]:
df1 =  pd.concat([df1 , pd.Series(we)] , axis = 1)
df1

   Age Name  Salary   0
0   20    A     100   2
1   30    B     200   5
2   31    C     120   6
3   35    D     300   7
4   27    E     450   9
5   29    F     600  10

In [133]:
# set is 1 dimensional represention of unique  data  where indexing is not possible

In [134]:
s1  = set([  10 , 20 , 30 , 30 , "pune"])
s1

{10, 20, 30, 'pune'}

In [135]:
s1[0]

TypeError: 'set' object does not support indexing

In [137]:
s1

{10, 20, 30, 'pune'}

In [138]:
list2  = list(s1)
list2

['pune', 10, 20, 30]

In [139]:
s1  = set([  10 , 20 , 30 , 30 , "pune"])

list3 = list(s1)
list3

['pune', 10, 20, 30]

In [140]:
#  format printing

In [141]:
state     =  "mh"
country   = "India"

print("he lives in state  {}   and country  {}" .format(state, country))

he lives in state  mh   and country  India

In [142]:
print("he lives in state  {}   and country  {}" .format( country , state))

he lives in state  India   and country  mh

In [145]:
state = "mh"  
country = "India"

In [147]:
state = "mh"   ;  country = "India"  ; print("he lives in state  {}   and country  {}" .format( country , state))

he lives in state  India   and country  mh

In [149]:
print(" he lives in state of"  , state)
print(" this state is in  country "  , country  )

 he lives in state of mh
 this state is in  country  India

In [151]:
print(" he lives in state of"  , state , end =" ")
print(" this state is in  country "  , country  )

 he lives in state of mh  this state is in  country  India

In [152]:
print(" he lives in state of"  , state  , " this state is in  country "  , country )

 he lives in state of mh  this state is in  country  India

In [154]:
## input function is used to  take the input  from the user

In [157]:
num  = input("number you wish to  enter")

number you wish to  enter7777

In [158]:
num

'7777'

In [159]:
num + 10

TypeError: Can't convert 'int' object to str implicitly

In [160]:
type(num)

str

In [161]:
# problem with input is that it stores all the data in string format

In [176]:
num  = eval(input("number you wish to  enter"))# eval will preserve the data type of the input entered by the user

number you wish to  enter40

In [177]:
num

40

In [178]:
num + 10

50

In [2]:
num  = float(input("number you wish to  enter"))

number you wish to  enter2000

In [183]:
num

100.0

In [3]:
a = 5
a

5

In [4]:
number  = input("enter a number")
number

enter a number200

'200'

In [5]:
type(number)

str

In [7]:
'200'  - 1

TypeError: unsupported operand type(s) for -: 'str' and 'int'

In [8]:
# problem with input is that it stores all the data in string format

In [9]:
number  = eval(input("enter a number"))  ## eval will preserve teh data type of the i/p given by th user 
number

enter a number200

200

In [10]:
number + 20

220

In [12]:
# conditional statments     if and else  and nested if else

In [16]:
i = 2

if i < 10:
    print("value of i is"  , i)
    print("we are inside if body")
else:
    print("value of is greater than  10 --->"  ,i)
    print("inside the else body")

value of i is 2
we are inside if body

In [19]:
## nested if else

In [23]:
rating = 5

if rating ==1 :
    print("product was not a good product")
elif rating == 2:
    print("product was ok type")
elif rating == 3:
    print("product was good")
elif rating == 4:
    print("product was excellent")
else:
    print("given rating is not the valid rating")

given rating is not the valid rating

In [24]:
rating = eval(input("enter the rating from 1 or  2 or 3 or 4"))

if rating ==1 :
    print("product was not a good product")
elif rating == 2:
    print("product was ok type")
elif rating == 3:
    print("product was good")
elif rating == 4:
    print("product was excellent")
else:
    print("given rating is not the valid rating")

enter the rating from 1 or  2 or 3 or 43
product was good

In [27]:
rating = eval(input("enter the rating from 1 or  2 or 3 or 4"))

if rating ==1:
    print("product was not a good product")
elif rating ==2:
    print("product was ok type")
elif rating ==3:
    print("product was good")
elif rating ==4:
    print("product was excellent")
else:
    print("rating was not the valid rating")

enter the rating from 1 or  2 or 3 or 460
rating was not the valid rating

In [ ]:
# loops     for loop

In [28]:
num  = [ 4 , 7,6,9 , 10 , 30 ,25]

In [29]:
for i in num:
    print(i)
    print(i*i)
    print("----------------")

4
16
----------------
7
49
----------------
6
36
----------------
9
81
----------------
10
100
----------------
30
900
----------------
25
625
----------------

In [30]:
sqaure_list = [] # empty list
for i in num:
    print(i)
    print(i*i)
    sqaure_list.append(i*i)
    print("----------------")

4
16
----------------
7
49
----------------
6
36
----------------
9
81
----------------
10
100
----------------
30
900
----------------
25
625
----------------

In [31]:
 sqaure_list

[16, 49, 36, 81, 100, 900, 625]

In [ ]:
sqaure_list = [] # empty list
for i in num:
    print(i)
    print(i*i)
    sqaure_list.append(i*i)
    print("----------------")

In [ ]:
sqaure_list.append(i*i)  # correct way

In [ ]:
sqaure_list  =   sqaure_list.append(i*i)  # wrong way

In [33]:
list1 = [] # empty list
for i in num:
    print(i)
    print(i*i)
    list1.append(i*i)
    print("----------------")

4
16
----------------
7
49
----------------
6
36
----------------
9
81
----------------
10
100
----------------
30
900
----------------
25
625
----------------

In [35]:
num  = [ 4 , 7,6,9 , 10 , 30 ,25]
square_list  = []
for i in num:
    print (i)
    print (i*i)
    square_list.append(i*i)
    print(square_list)
    print ("**__________________**")

4
16
[16]
**__________________**
7
49
[16, 49]
**__________________**
6
36
[16, 49, 36]
**__________________**
9
81
[16, 49, 36, 81]
**__________________**
10
100
[16, 49, 36, 81, 100]
**__________________**
30
900
[16, 49, 36, 81, 100, 900]
**__________________**
25
625
[16, 49, 36, 81, 100, 900, 625]
**__________________**

In [36]:
# create a loop / code which runs from number 1 to 100 and store all even numebr in even list and all odd number in odd list

In [38]:
num1  = list(range(1, 101))

In [41]:
 10 % 2

0

In [45]:
odd_list = []
even_list = []
num_1= list (range(1,101))
for vaidya in num_1:
    if vaidya % 2 == 0:
        even_list.append(vaidya)
    else:
        odd_list.append(vaidya)

In [48]:
aa = list (range(1,10))  # it will go till last number but will NOT INCLUDE last number 
aa

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [49]:
##  6: 40  pm break

In [ ]:
###  for loop on the dictionary

In [2]:
dict1  =  ({"Mr.a" : 20 , "Mr.B" : 30 , "Mr.c" : 30})

In [3]:
dict1.keys()

dict_keys(['Mr.B', 'Mr.a', 'Mr.c'])

In [4]:
dict1.values()

dict_values([30, 20, 30])

In [5]:
for i in dict1.keys():
    print(i)
    print("------")

Mr.B
------
Mr.a
------
Mr.c
------

In [7]:
for j in dict1.values():
    print(j)
    print("------")

30
------
20
------
30
------

In [9]:
#  while  loop  ( it will run till condition is satisfied )

In [11]:
# i = 1
# while i < 20:
#     print(i)
#     print("square of num is     " , i)
#     print("------")
#     i = i + 1

In [12]:
## lets create our user defined function

In [29]:
def add_num( a, b):   ## a, b arguments ( used to pass input to function)
    """
    this prog is used to add to numbers ..user needs to pass to 2 numbers
    o/p would stored in result and result here is of global type
    """
    print(a)
    print(b)
    global result
    result = a +b
    print(result)

In [30]:
add_num( 10.5677 , 3000)

10.5677
3000
3010.5677

In [31]:
add_num( 10.5677 , 3000)

10.5677
3000
3010.5677

In [46]:
###  try , except , finally



def add_num( a, b):   ## a, b arguments ( used to pass input to function)
    """
    this prog is used to add to numbers ..user needs to pass to 2 numbers
    o/p would stored in result and result here is of global type
    
    """
    try:       
        print(a)
        print(b)
        result = a + b
        print(result)
    except:
        print(" you have made the error...value of a and b should be numeric")
    finally:
        print(" you have added the values...Thank You")

In [47]:
add_num( 10, 11)

10
11
21
 you have added the values...Thank You

In [48]:
add_num( 10, 'data')

10
data
 you have made the error...value of a and b should be numeric
 you have added the values...Thank You

In [49]:
##  lambda function

##  lambda is a anonymus function

In [52]:
def add_num( a, b):   ## a, b arguments ( used to pass input to function)
    """
    this prog is used to add to numbers ..user needs to pass to 2 numbers
    o/p would stored in result and result here is of global type
    """
    print(a)
    print(b)
    global result
    result = a +b
    return(result)   # return command should always be the last command in your function and it returns the value which you want

In [53]:
add_num( 3, 5)

3
5

8

In [54]:
##  lambda function

##  lambda is a anonymus function we do not use the word "def"  while creating the function

In [57]:
first_lam_function = lambda a,b,c,d  :   (a +b+c+d)

In [58]:
first_lam_function(2,5,7,10)

24

In [59]:
## lambda functions become very power full when combined with   "map"  option

In [60]:
#  you want to convert  celsius to farhantie

In [61]:
temp = (20,30,100,200,0)

In [62]:
list(  map   (  lambda x  :   1.8*x + 32,    temp) )  #   map is used to pass data in squence

[68.0, 86.0, 212.0, 392.0, 32.0]

In [ ]:
#  lambda x:   1.8*x + 32

In [63]:
# i want to print square of number  from 1 to 10
num = list(range(1,11))

In [64]:
list(map(lambda  input  : input * input  , num))

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [1]:
#  lambda do not use "def"  , they are  anonymus   and  "RETURN"  function can not be used in Lambdas
# they are created where ever you want to use it and not for later purpose

In [2]:
import pandas as pd

In [ ]:
##  path , file name , type

In [4]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv")  # r raw

In [16]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [18]:
cr.tail(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
980,LP002989,Male,No,0.0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [19]:
#cr1 =  pd.read_clipboard()

In [11]:
#cr1.head()

In [20]:
cr.shape

(981, 13)

In [21]:
cr.shape[0]

981

In [24]:
cr.shape[1]

13

In [25]:
#cr.Gender ## to select the col

0      Male
1      Male
2      Male
3      Male
4      Male
       ...
976    Male
977    Male
978    Male
979    Male
980    Male
Name: Gender, Length: 981, dtype: object

In [27]:
#cr['Gender'] ## to select the col

In [29]:
cr.ApplicantIncome.mean()

5179.795107033639

In [30]:
cr.ApplicantIncome.median()

3800.0

In [31]:
cr.ApplicantIncome.std()

5695.104532539106

In [32]:
cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [33]:
cr.Gender.describe()

count      957
unique       2
top       Male
freq       775
Name: Gender, dtype: object

In [34]:
cr.Property_Area.describe()

count           981
unique            3
top       Semiurban
freq            349
Name: Property_Area, dtype: object

In [35]:
cr.Gender.value_counts()

Male      775
Female    182
Name: Gender, dtype: int64

In [36]:
cr.Gender.describe()

count      957
unique       2
top       Male
freq       775
Name: Gender, dtype: object

In [37]:
cr.ApplicantIncome.describe()

count      981.000000
mean      5179.795107
std       5695.104533
min          0.000000
25%       2875.000000
50%       3800.000000
75%       5516.000000
max      81000.000000
Name: ApplicantIncome, dtype: float64

In [38]:
cr.describe()

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,956.000000,981.000000,981.000000,954.000000,961.000000,902.000000
mean,0.881799,5179.795107,1601.916330,142.511530,342.201873,0.835920
std,1.255623,5695.104533,2718.772806,77.421743,65.100602,0.370553
min,0.000000,0.000000,0.000000,9.000000,6.000000,0.000000
25%,0.000000,2875.000000,0.000000,100.000000,360.000000,1.000000
50%,0.000000,3800.000000,1110.000000,126.000000,360.000000,1.000000
75%,2.000000,5516.000000,2365.000000,162.000000,360.000000,1.000000
max,4.000000,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [39]:
cr.describe()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,981,957,978,956.000000,981,926,981.000000,981.000000,954.000000,961.000000,902.000000,981,981
unique,981,2,2,NaN,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001291,Male,Yes,NaN,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,775,631,NaN,763,807,NaN,NaN,NaN,NaN,NaN,349,712
mean,NaN,NaN,NaN,0.881799,NaN,NaN,5179.795107,1601.916330,142.511530,342.201873,0.835920,NaN,NaN
std,NaN,NaN,NaN,1.255623,NaN,NaN,5695.104533,2718.772806,77.421743,65.100602,0.370553,NaN,NaN
min,NaN,NaN,NaN,0.000000,NaN,NaN,0.000000,0.000000,9.000000,6.000000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,0.000000,NaN,NaN,2875.000000,0.000000,100.000000,360.000000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,0.000000,NaN,NaN,3800.000000,1110.000000,126.000000,360.000000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,2.000000,NaN,NaN,5516.000000,2365.000000,162.000000,360.000000,1.000000,NaN,NaN
max,NaN,NaN,NaN,4.000000,NaN,NaN,81000.000000,41667.000000,700.000000,480.000000,1.000000,NaN,NaN

In [40]:
cr.Gender.describe()

count      957
unique       2
top       Male
freq       775
Name: Gender, dtype: object

In [41]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 981 entries, 0 to 980
Data columns (total 13 columns):
Loan_ID              981 non-null object
Gender               957 non-null object
Married              978 non-null object
Dependents           956 non-null float64
Education            981 non-null object
Self_Employed        926 non-null object
ApplicantIncome      981 non-null int64
CoapplicantIncome    981 non-null float64
LoanAmount           954 non-null float64
Loan_Amount_Term     961 non-null float64
Credit_History       902 non-null float64
Property_Area        981 non-null object
Loan_Status          981 non-null object
dtypes: float64(5), int64(1), object(7)
memory usage: 99.8+ KB

In [42]:
### lets find the null values

In [44]:
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [46]:
cr.isnull().sum() * 100 / cr.shape[0]  ##  percentage of nulls

Loan_ID              0.000000
Gender               2.446483
Married              0.305810
Dependents           2.548420
Education            0.000000
Self_Employed        5.606524
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           2.752294
Loan_Amount_Term     2.038736
Credit_History       8.053007
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [47]:
cr.columns[ cr.isnull().sum() * 100 / cr.shape[0]  > 5 ]  ##  ?

Index(['Self_Employed', 'Credit_History'], dtype='object')

In [48]:
cr.columns[ cr.isnull().sum() * 100 / cr.shape[0]  > 0 ]  ##

Index(['Gender', 'Married', 'Dependents', 'Self_Employed', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History'],
      dtype='object')

In [52]:
cr.Gender  = cr.Gender.fillna('Male')
cr.Married =cr.Married.fillna('Yes')

In [51]:
cr.LoanAmount   = cr.LoanAmount.fillna(  126  )

Yes    631
No     347
Name: Married, dtype: int64

In [54]:
cr.LoanAmount   = cr.LoanAmount.fillna(  cr.LoanAmount.mean() )

In [55]:
cr.Dependents = cr.Dependents.fillna(1)

0      0.0
1      1.0
2      0.0
3      0.0
4      0.0
      ...
976    4.0
977    0.0
978    0.0
979    0.0
980    0.0
Name: Dependents, Length: 981, dtype: float64

In [56]:
cr.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [74]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv")

In [77]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() , inplace = True) # correct
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [78]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.Loan_Amount_Term  =cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() )  # correct
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [79]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() , inplace = True)
cr.isnull().sum()
#  this is  WRONG

Loan_ID                0
Gender                24
Married                3
Dependents            25
Education              0
Self_Employed         55
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            27
Loan_Amount_Term     981
Credit_History        79
Property_Area          0
Loan_Status            0
dtype: int64

In [ ]:
##   7: 10

In [86]:
# age    = int(input('What is your age: '))
# gender = input('What is your gender: ')
# weight = int(input('What is your weight: '))
# height = int(input('What is your height in inches: '))

#     if gender == 'male':
#         c1 = 66
#         hm = 6.2 * height
#         wm = 12.7 * weight
#         am = 6.76 * age
#         bmi_result = c1 + hm + wm - am
#     elif gender == 'female':
#         c1 = 65.51
#         hm = 4.35 * height
#         wm = 4.7 * weight
#         am = 4.7 * age
#         bmi_result = c1 + hm + wm - am

In [87]:
age    = int(input('What is your age: '))
gender = input('What is your gender: ')
weight = int(input('What is your weight: '))
height = int(input('What is your height in inches: '))

# def bmi(age  , gender , weight , height):
#     if gender == 'male':
#         c1 = 66
#         hm = 6.2 * height
#         wm = 12.7 * weight
#         am = 6.76 * age
#         bmi_result_male = c1 + hm + wm - am  
#         print(bmi_result_male)
#     elif gender == 'female':
#         c1 = 65.51
#         hm = 4.35 * height
#         wm = 4.7 * weight
#         am = 4.7 * age
#         bmi_result_female = c1 + hm + wm - am   
#         print(bmi_result_female)

What is your age: 3
What is your gender: 3
What is your weight: 3
What is your height in inches: 3

In [88]:
# def bmi(age  , gender , weight , height):
#     if gender == 'male':
#         c1 = 66
#         hm = 6.2 * height
#         wm = 12.7 * weight
#         am = 6.76 * age
#         bmi_result_male = c1 + hm + wm - am  
#         print(bmi_result_male)
#     elif gender == 'female':
#         c1 = 65.51
#         hm = 4.35 * height
#         wm = 4.7 * weight
#         am = 4.7 * age
#         bmi_result_female = c1 + hm + wm - am   
#         print(bmi_result_female)

In [89]:
# bmi(age  , gender , weight , height)

In [90]:
cr.corr()  # pearson , spearman rank  , kedndals

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Credit_History
Dependents,1.000000,0.137819,-0.003428,0.149586,-0.057913
ApplicantIncome,0.137819,1.000000,-0.114247,0.551811,0.023378
CoapplicantIncome,-0.003428,-0.114247,1.000000,0.179228,-0.027253
LoanAmount,0.149586,0.551811,0.179228,1.000000,-0.008235
Credit_History,-0.057913,0.023378,-0.027253,-0.008235,1.000000

In [91]:
# i want to create a df where only those poeple who are earning more than 3500 ( Applicant Income  is more than 3500)

In [93]:
df1  =  cr[cr.ApplicantIncome > 3500]

In [94]:
df1.shape

(560, 13)

In [95]:
# i want to create a df where only those poeple who are earning more than 3500 ( Applicant Income  is more than 3500)
##  and person should be male

In [102]:
df2 = cr[cr.ApplicantIncome >3500][ cr.Gender == "Male"]
df2.shape

F:\pranjal\Python_anaconda\envs\py35\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

(452, 13)

In [100]:
d21=cr[(cr.ApplicantIncome>3500 )   &    (cr.Gender=='Male')  ]
d21.shape

(452, 13)

In [101]:
d21.head(20)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,None,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,None,1.0,Rural,N
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,None,1.0,Urban,Y
5,LP001011,Male,Yes,2.0,Graduate,Yes,5417,4196.0,267.0,None,1.0,Urban,Y
8,LP001018,Male,Yes,2.0,Graduate,No,4006,1526.0,168.0,None,1.0,Urban,Y
9,LP001020,Male,Yes,1.0,Graduate,No,12841,10968.0,349.0,None,1.0,Semiurban,N
15,LP001032,Male,No,0.0,Graduate,No,4950,0.0,125.0,None,1.0,Urban,Y
16,LP001034,Male,No,1.0,Not Graduate,No,3596,0.0,100.0,None,NaN,Urban,Y
18,LP001038,Male,Yes,0.0,Not Graduate,No,4887,0.0,133.0,None,1.0,Rural,N
20,LP001043,Male,Yes,0.0,Not Graduate,No,7660,0.0,104.0,None,0.0,Urban,N
21,LP001046,Male,Yes,1.0,Graduate,No,5955,5625.0,315.0,None,1.0,Urban,Y
24,LP001052,Male,Yes,1.0,Graduate,NaN,3717,2925.0,151.0,None,NaN,Semiurban,N
25,LP001066,Male,Yes,0.0,Graduate,Yes,9560,0.0,191.0,None,1.0,Semiurban,Y
27,LP001073,Male,Yes,2.0,Not Graduate,No,4226,1040.0,110.0,None,1.0,Urban,Y
30,LP001091,Male,Yes,1.0,Graduate,NaN,4166,3369.0,201.0,None,NaN,Urban,N
32,LP001097,Male,No,1.0,Graduate,Yes,4692,0.0,106.0,None,1.0,Rural,N
34,LP001100,Male,No,4.0,Graduate,No,12500,3000.0,320.0,None,1.0,Rural,N
38,LP001114,Male,No,0.0,Graduate,No,4166,7210.0,184.0,None,1.0,Urban,Y
39,LP001116,Male,No,0.0,Not Graduate,No,3748,1668.0,110.0,None,1.0,Semiurban,Y
40,LP001119,Male,No,0.0,Graduate,No,3600,0.0,80.0,None,1.0,Urban,N

In [103]:
#  select the records based on postion

# i want to select the  columns --> 1st ,4,7,10

# want to select row ( 10 , 100 , 500 , 600 ,700,)

In [ ]:
#    done in R cr[c(10,100,500,600,700)  , c(1,4,7,10)]

In [105]:
cr.iloc[   [9 , 99, 499, 599 ,699]     ,      [0,3,6,9]]  # iloc  ( index location)

      Loan_ID  Dependents  ApplicantIncome Loan_Amount_Term
9    LP001020         1.0            12841             None
99   LP001343         0.0             1759             None
499  LP002602         0.0             6283             None
599  LP002948         2.0             5780             None
699  LP001452         2.0             4635             None

In [129]:
import pandas as pd
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
#cr.iloc[[9,99,499,599,699],[0,3,6,9]]

In [114]:
# i want to select    columns --> 1st ,4,7,10       and  ALL rows

In [116]:
df3 =  cr.iloc[  :    , [0,3,6,9]]

In [117]:
df3.shape

(981, 4)

In [118]:
df1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,None,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,None,1.0,Rural,N
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,None,1.0,Urban,Y
5,LP001011,Male,Yes,2.0,Graduate,Yes,5417,4196.0,267.0,None,1.0,Urban,Y
8,LP001018,Male,Yes,2.0,Graduate,No,4006,1526.0,168.0,None,1.0,Urban,Y

In [119]:
#  i want to select all rows and all cols from 4th till end

In [120]:
cr.iloc[: ,[3: 12]]

SyntaxError: invalid syntax (<ipython-input-120-ac115080a984>, line 1)

In [127]:
df4 = cr.iloc[:   , 3:  12] #  it goes till 12 but does not includes 12
df4.head(2)   # loan_status was not included

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban
1,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural

In [130]:
cr.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [131]:
df5  = cr.iloc[: ,[3,4,5,6,7,8,9,10,11,12]]  # it exactly takes 12 
df5.head(2)

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

In [133]:
list(range(0,10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [136]:
cr5 =  cr.iloc[:   , 3:  130]
cr5.head(1)

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [139]:
cr5  = cr.iloc[: ,[3,4,5,6,7,8,9,10,11,12]]

In [147]:
# now lets create a df using the "loc"  instead of  'iloc'
#  when using loc instead of giving postion give the names of the cols

In [148]:
#  create a df which has cols ( gender , applicant income and  loan_status)    and all records

In [149]:
cr6 = cr.loc[ : , ['Gender' , 'ApplicantIncome'  , 'Loan_Status']]
cr6.head()

  Gender  ApplicantIncome Loan_Status
0   Male             5849           Y
1   Male             4583           N
2   Male             3000           Y
3   Male             2583           Y
4   Male             6000           Y

In [153]:
#cr.head(2)

In [154]:
#cr.iloc[: , [-2 ,-1]]

In [155]:
#  lets rename the cols

In [156]:
cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [157]:
#  rename "ApplicantIncome"  -->  appinc
# rename  "CoapplicantIncome" --> coapinc

In [158]:
cr6 = cr.rename(columns ={'ApplicantIncome' : 'appinc'     ,     'CoapplicantIncome' : 'coapinc'})

In [159]:
cr6.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,appinc,coapinc,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [160]:
#  another way to rename  instead of giving column name give the postion

#  rename the  Dependents  col as dep

cr7 = cr.rename(columns= {cr.columns[3]   : "dep"})

In [161]:
cr7.head(1)

,Loan_ID,Gender,Married,dep,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [164]:
# try to replace the non-numeric data with numeric

In [170]:
cr.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0.0,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [167]:
cr.Gender.value_counts()

Male      775
Female    182
Name: Gender, dtype: int64

In [172]:
#cr.Gender = cr.Gender.replace({"Ma'le" :0 , "Female" :1})

In [173]:
cr.Married.value_counts()

Yes    631
No     347
Name: Married, dtype: int64

In [174]:
cr.Married =  cr.Married.replace({"Yes":1 , "No" :0})

In [175]:
#  more the one columns can be replace in single line of  code

In [176]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv")

In [179]:
cr.replace({'Gender' : {"Male" :0 , "Female" :1} ,   'Married' :{"Yes":1 , "No" :0} } , inplace = True )

In [185]:
# 
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
pd.crosstab(cr.Gender , cr.Loan_Status)

Loan_Status    N    Y
Gender
Female        55  127
Male         207  568

In [187]:
cr.groupby('Education').ApplicantIncome.mean()

Education
Graduate        5602.440367
Not Graduate    3700.536697
Name: ApplicantIncome, dtype: float64

In [190]:
cr.groupby(['Education','Gender']).ApplicantIncome.mean().round()

Education     Gender
Graduate      Female    4598.0
              Male      5726.0
Not Graduate  Female    3853.0
              Male      3695.0
Name: ApplicantIncome, dtype: float64

In [191]:
cr.groupby(['Education','Gender' ,'Married']).ApplicantIncome.mean().round()

Education     Gender  Married
Graduate      Female  No         4425.0
                      Yes        4861.0
              Male    No         5269.0
                      Yes        5909.0
Not Graduate  Female  No         4260.0
                      Yes        3001.0
              Male    No         3664.0
                      Yes        3707.0
Name: ApplicantIncome, dtype: float64

In [194]:
cr.groupby('Education').ApplicantIncome.max()

Education
Graduate        81000
Not Graduate    18165
Name: ApplicantIncome, dtype: int64

In [196]:
cr.groupby('Education').ApplicantIncome.agg(['max' ,'min' ,'median' ,'mean'])

                max  min  median         mean
Education
Graduate      81000    0    4000  5602.440367
Not Graduate  18165    0    3333  3700.536697

In [198]:

#  to drop a column

In [204]:
#

cr1 = cr.loc[ : ,['Education', 'ApplicantIncome' , 'CoapplicantIncome' ] ]
cr1.groupby('Education').agg(['max' ,'min' ,'median' ,'mean'])

             ApplicantIncome                         CoapplicantIncome       \
                         max min median         mean               max  min
Education
Graduate               81000   0   4000  5602.440367           41667.0  0.0
Not Graduate           18165   0   3333  3700.536697           13983.0  0.0


              median         mean
Education
Graduate      1030.0  1689.618506
Not Graduate  1271.0  1294.958716

In [205]:
## lets drop a column

In [206]:
cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [207]:
#  i want to drop 'Loan_ID'
cr.drop(['Loan_ID'] , axis = 1 , inplace = True)
cr.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [208]:
#  sort   the data based on a column
#  sort the DF based on Applicant Income

In [209]:
cr_sort  = cr.sort_values('ApplicantIncome')

In [211]:
cr_sort1  = cr.sort_values('ApplicantIncome' , ascending= False)

In [213]:
#cr_sort1.head(20)

In [214]:
#  try to add a column to my existing data frame 

#  income of the people have doubled

new_income = 2 * cr.ApplicantIncome

# lets add new_income to my existing DF and create a new df

In [217]:
cr_new = pd.concat([cr ,new_income ] , axis =1)

In [218]:
cr_new.shape

(981, 13)

In [219]:
cr.shape

(981, 12)

In [220]:
cr_new.head(2)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,ApplicantIncome
0,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,11698
1,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,9166

In [221]:
#  change the name of the new column( last col)  (New_Income) 
# but do not change the name of the original col

In [222]:

cr_new.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status',
       'ApplicantIncome'],
      dtype='object')

In [223]:
list1 = list(cr_new.columns)
list1

['Gender',
 'Married',
 'Dependents',
 'Education',
 'Self_Employed',
 'ApplicantIncome',
 'CoapplicantIncome',
 'LoanAmount',
 'Loan_Amount_Term',
 'Credit_History',
 'Property_Area',
 'Loan_Status',
 'ApplicantIncome']

In [228]:
list1[12]  = 'New_Income'
#list1

In [227]:

cr_new.columns  = list1

#cr_new.head()

In [229]:
### Label encoder  

### but label  enoder should be used only after removing the nulls

In [ ]:
#  aim of Label encoder is to convert the labeled / Non numeric   to Numeric

In [230]:
#  lets read our file remove the nulls and do the label encoding

In [2]:
import pandas as pd
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [3]:
# lets remove our nulls

In [4]:
cr.Gender= cr.Gender.fillna('Male')
cr.Married= cr.Married.fillna('Yes')
cr.LoanAmount= cr.LoanAmount.fillna(cr.LoanAmount.median())
cr.Dependents= cr.Dependents.fillna(1)
cr.Self_Employed= cr.Self_Employed.fillna('No')
cr.Loan_Amount_Term= cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median())
cr.Credit_History= cr.Credit_History.fillna(0)

In [5]:
cr.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [6]:
#  lets remove the loan id

cr =  cr.iloc[:  , 1: 14]
cr.head(1)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0.0,Graduate,No,5849,0.0,126.0,360.0,1.0,Urban,Y

In [7]:
import sklearn

from sklearn.preprocessing  import  LabelEncoder

In [8]:
le  = LabelEncoder()  # i am creating an object / running the function for the 1st time

In [12]:
cr.Gender  = le.fit_transform(cr.Gender)

In [13]:
cr.Married = le.fit_transform(cr.Married)
cr.Self_Employed  = le.fit_transform(cr.Self_Employed)
cr.Education  = le.fit_transform(cr.Education)
cr.Property_Area  = le.fit_transform(cr.Property_Area)
cr.Loan_Status   = le.fit_transform(cr.Loan_Status)

In [14]:
cr.head(10)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0.0,0,0,5849,0.0,126.0,360.0,1.0,2,1
1,1,1,1.0,0,0,4583,1508.0,128.0,360.0,1.0,0,0
2,1,1,0.0,0,1,3000,0.0,66.0,360.0,1.0,2,1
3,1,1,0.0,1,0,2583,2358.0,120.0,360.0,1.0,2,1
4,1,0,0.0,0,0,6000,0.0,141.0,360.0,1.0,2,1
5,1,1,2.0,0,1,5417,4196.0,267.0,360.0,1.0,2,1
6,1,1,0.0,1,0,2333,1516.0,95.0,360.0,1.0,2,1
7,1,1,4.0,0,0,3036,2504.0,158.0,360.0,0.0,1,0
8,1,1,2.0,0,0,4006,1526.0,168.0,360.0,1.0,2,1
9,1,1,1.0,0,0,12841,10968.0,349.0,360.0,1.0,1,0

In [18]:
##    lets convert all data in single line

In [52]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.Gender= cr.Gender.fillna('Male')
cr.Married= cr.Married.fillna('Yes')
cr.LoanAmount= cr.LoanAmount.fillna(cr.LoanAmount.median())
cr.Dependents= cr.Dependents.fillna(1)
cr.Self_Employed= cr.Self_Employed.fillna('No')
cr.Loan_Amount_Term= cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median())
cr.Credit_History= cr.Credit_History.fillna(0)
cr =  cr.iloc[:  , 1: 14]

#cr.head(10)

In [53]:
#cr.info()

In [54]:
cr.select_dtypes(include=['object']).columns

Index(['Gender', 'Married', 'Education', 'Self_Employed', 'Property_Area',
       'Loan_Status'],
      dtype='object')

In [55]:
#cr[   cr.select_dtypes(include=['object']).columns     ] #  a df is created which consist of only the object cols

In [56]:
## now we will invoke Label encoder in this Df instead of running on each columns
cr[   cr.select_dtypes(include=['object']).columns     ]   = cr[   cr.select_dtypes(include=['object']).columns     ].apply(le.fit_transform)

In [57]:
#cr.head(10)

In [58]:
#  sampling

In [59]:
cr.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0.0,0,0,5849,0.0,126.0,360.0,1.0,2,1
1,1,1,1.0,0,0,4583,1508.0,128.0,360.0,1.0,0,0
2,1,1,0.0,0,1,3000,0.0,66.0,360.0,1.0,2,1
3,1,1,0.0,1,0,2583,2358.0,120.0,360.0,1.0,2,1
4,1,0,0.0,0,0,6000,0.0,141.0,360.0,1.0,2,1

In [60]:
from sklearn.model_selection  import train_test_split

In [61]:
## lets take the 1st approach (  Train and test    and then X and  Y)

In [67]:
train , test   = train_test_split( cr , test_size  = .2 )

In [68]:
train.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
768,1,1,2.0,0,0,4855,0.0,72.0,360.0,1.0,0,1
71,1,1,2.0,1,1,1875,1875.0,97.0,360.0,1.0,1,1
862,1,1,0.0,1,1,3943,0.0,64.0,360.0,1.0,1,1
163,1,1,2.0,0,0,4167,1447.0,158.0,360.0,1.0,0,1
807,1,1,4.0,1,0,2654,1998.0,128.0,360.0,0.0,0,0

In [69]:
#  row number 922 of the original data is now the 1st record in my train data

In [71]:
# lests divide train   into train_x and train_y
# lests divide test  into test_x and test_y

In [74]:
train_x  = train.iloc[: , 0 : 11]
train_y = train.iloc[: , -1]
train_x.head(1)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
768,1,1,2.0,0,0,4855,0.0,72.0,360.0,1.0,0

In [76]:
test_x  = test.iloc[: , 0 : 11]
test_y   = test.iloc[: , -1]

In [77]:
train.shape

(784, 12)

In [88]:
#  dummy vairables  (   one hot encoding)

## used to convert the non numeric tp numeric

#

In [94]:
cr = pd.read_csv(r"C:\Users\Pranjal Mishra\Documents\CreditRisk.csv") 
cr.Gender= cr.Gender.fillna('Male')
cr.Married= cr.Married.fillna('Yes')
cr.LoanAmount= cr.LoanAmount.fillna(cr.LoanAmount.median())
cr.Dependents= cr.Dependents.fillna(1)
cr.Self_Employed= cr.Self_Employed.fillna('No')
cr.Loan_Amount_Term= cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median())
cr.Credit_History= cr.Credit_History.fillna(0)
cr =  cr.iloc[:  , 1: 14]


cr.Loan_Status  = cr.Loan_Status.replace({"Y": 1 , "N"  : 0})

In [99]:
#cr.head()

In [96]:
cr1 = pd.get_dummies(cr)

In [97]:
cr1.shape

(981, 18)

In [98]:
cr1.head()

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Gender_Female,Gender_Male,Married_No,Married_Yes,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
0,0.0,5849,0.0,126.0,360.0,1.0,1,0,1,1,0,1,0,1,0,0,0,1
1,1.0,4583,1508.0,128.0,360.0,1.0,0,0,1,0,1,1,0,1,0,1,0,0
2,0.0,3000,0.0,66.0,360.0,1.0,1,0,1,0,1,1,0,0,1,0,0,1
3,0.0,2583,2358.0,120.0,360.0,1.0,1,0,1,0,1,0,1,1,0,0,0,1
4,0.0,6000,0.0,141.0,360.0,1.0,1,0,1,1,0,1,0,1,0,0,0,1

In [100]:
cr.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0.0,Graduate,No,5849,0.0,126.0,360.0,1.0,Urban,1
1,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,0
2,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,1
3,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,1
4,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,1

In [101]:
#  try doing your data cleaning on the Property price  and also do sampling

In [103]:
import os

In [104]:
os.getcwd()

'C:\\Users\\Pranjal Mishra'